#Пользователь вводит одно натуральное число из промежутка от 10 до 99 включительно.
print('Enter two numbers 10-99: ')

num = input()
print(num[0], num[1])